{"data":{"allMenuItemsJson":{"edges":[{"node":{"description":"","id":"0","name":"starters","items":[{"id":"st-0","title":"Nachos Supreme","description":"Chips, cheese, carne guisda meat, sour cream, and jalapeños."},{"id":"st-1","title":"Nachos Fries","description":"Fries, cheese, carne guisda meat, sour cream, and jalapeños."}]}},{"node":{"description":"","id":"1","name":"tacos","items":[{"id":"t-0","title":"Taco Plate","description":"Your choice of Carne Guisada, Al Pastor, Carnitas, Chicaron Con Salsa, Chicharon Con Crispy, Bistec, Longanisa, Fajitas, or Barbecoa meat served with a side of rice and beans."},{"id":"t-1","title":"Single Tacos","description":"Your choice of Carne Guisada, Al Pastor, Carnitas, Chicaron Con Salsa, Chicharon Con Crispy, Bistec, Longanisa, Fajitas, or Barbecoa meat."}]}},{"node":{"description":"","id":"2","name":"not tacos","items":[{"id":"nt-0","title":"Chimi Plate","description":"Your choice of taco meat in a chimichanga topped with cheese, served with a side of rice and beans."},{"id":"nt-1","title":"Flauritto Plate","description":"A burrito stuffed with our handmade flautas, served with a side of rice and beans."},{"id":"nt-2","title":"Enchiladas Plate","description":"Your choice of taco meat in enchiladas topped with red sauce, served with a side of rice and beans."},{"id":"nt-3","title":"Burrito Plate","description":"Your choice of taco meat in our signature burrito, served with a side of rice and beans."},{"id":"nt-4","title":"Gorditas Plate","description":"Your choice of taco meat in our handmade gorditas, served with a side of rice and beans."},{"id":"nt-5","title":"Flautas Plate","description":"Your choice of taco meat in our handmade flautas, topped with cheese, served with a side of rice and beans."}]}},{"node":{"description":"","id":"3","name":"sandwiches","items":[{"id":"s-0","title":"BBQ Sandwich Plate","description":"White bun, BBQ meat, pickles, onions, served with a side of fries, and jalapeños."},{"id":"s-1","title":"Chicken Sandwich Plate","description":"White bun, Chicken meat, pickles, onions, served with a side of fries, and jalapeños."},{"id":"s-2","title":"Hamburguesa","description":"White bun, soy patty, lettuce, pickles, onions, tomato, cheese, served with a side of fries, and jalapeños."},{"id":"s-3","title":"Torta Plate","description":"White bun, meat, pickles, onions, served with a side of fries, and jalapeños."}]}}]}}}